app/controllers/contacts_controller.rb

  def index
    render json: { status: 200, contacts: Contact.all }
---
SELECT "contacts".* FROM "contacts"

  def show
    contact = Contact.find(params[:id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
     contact = Contact.new(contact_params)

     if contact.save
---
INSERT INTO "contacts" ("name", "city", "state", "country", "birthday", "bio", "phone", "email", "artwork") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

   def update
     contact = Contact.find(params[:id])
     contact.update(contact_params)
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
UPDATE "contacts" SET "name" = $1, "city" = $2, "state" = $3, "country" = $4, "birthday" = $5, "phone" = $6, "email" = $7 WHERE "contacts"."id" = $8  [["name", "Rob Brown"], ["city", "Jonesboro"], ["state", "AR"], ["country", "United States"], ["birthday", "May 5"], ["phone", "555.555.5555"], ["email", "user@email.com"], ["id", 20]]

   def destroy
    contact = Contact.destroy(params[:id])
---
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 26]]